#encoding=utf-8
# 中国矿业大学（北京）/ 机电硕-6 / ZQT2000405103 / 李天鸽
# 编辑时间：2021/1/18 17:21

# 输出北京的天气预报、
fp = open('D:/pycharm/输出数据/print/天气预报.txt','a')
print('周一   ','今天',file=fp)
print('---------------------------------------',file=fp)
print('08时  ','11时  ','14时  ','17时  ','20时  ','23时',file=fp)
print('-4℃  ','3℃   ','3℃   ','1℃   ','-4℃  ','-4℃',file=fp)
print('---------------------------------------',file=fp)
print('明 天  ','1/19 ','-7℃/0℃',file=fp)
print('后 天  ','1/20 ','-7℃/4℃',file=fp)
print('周 四  ','1/21 ','-5℃/7℃',file=fp)
print('周 五  ','1/22 ','-5℃/5℃',file=fp)
print('周 六  ','1/23 ','-6℃/3℃',file=fp)
print('周 日  ','1/24 ','-5℃/7℃',file=fp)
fp.close()
